package com.kh.methodEx;

/*
메서드(method)
	특정 행동이나 작업을 진행하는 코드 블록 { }
	
	setter : 필드에 작성한 변수를 복사해서 원본 변수 대신 값을 변경하고 저장하는 메서드
			 this.변수 = 매개변수;
	getter : Setter에 저장된 변수 값을 다른곳에서 사용할 수 있도록 전달해주는 메서드
	
	생성자 : 파일명과 클래스이름과 똑같이 작성을 해줘야하고 객체의 기본 값을 설정하거나 값을 각각 변경해서 사용하는데 쓰이는 메서드
		기본 생성자 : 매개변수가 필수로 없어도 되는 생성자 / 필수 입력이 없음
		필수 생성자 : 매개변수가 필수로 존재해야하는 생성자 / 필수로 작성해줬으면 하는 값을 표기
		
	void : 어떤 행동을 수행하기 위해 작성하고, 수행한 다음 특별히 전달할 내용이 없을 때 사용
		   메서드가 끝난 후 반환 값이 없음
	
	return : 어떤 행동을 실행하고 행동을 한 다음에 행동에 대한 결과를 필요한 곳에 전달
		 	 메서드를 작성해줄 때 컴퓨터가 어떤 자료형인지(공간을 얼마나 줘야하는지)를 전달해주고
			 처음에 작성한 자료형과 마지막에 전달할 자료형이 동일해야함
			 
	main : 최종으로 실행하거나 최종으로 실행하고 싶은 내용만 작성하는 메서드
*/

public class 기본메서드 {

	
}
